## Plan for org_account/organization
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_organizations_policy.quarantine_deny_all_policy`                         |
|        | `aws_organizations_policy.scp_deny_ec2_run`                                   |
|        | `aws_organizations_policy_attachment.AFT-scp_deny_ec2_run`                    |
|        | `aws_organizations_policy_attachment.DumpsterFire-quarantine_deny_all_policy` |
|        | `aws_organizations_policy_attachment.Production-scp_deny_ec2_connect`         |
|        | `aws_organizations_policy_attachment.SRETools-scp_deny_ec2_run`               |
|        | `aws_organizations_policy_attachment.Sandbox-scp_deny_ec2_run`                |
|        | `aws_organizations_policy_attachment.Security-scp_deny_ec2_run`               |
|        | `aws_organizations_policy_attachment.Staging-scp_deny_ec2_connect`            |
|        | `aws_organizations_policy_attachment.Test-scp_deny_ec2_run`                   |
| delete | `aws_organizations_policy.qurantine_deny_all_policy`                          |
|        | `aws_organizations_policy_attachment.DumpsterFire-qurantine_deny_all_policy`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_organizations_policy.quarantine_deny_all_policy will be created
  + resource "aws_organizations_policy" "quarantine_deny_all_policy" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:username" = [
                                  + "ops1",
                                  + "ops2",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                      + Sid       = "DenyAllActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Quarantine account and Deny All Policy"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.qurantine_deny_all_policy will be destroyed
  # (because aws_organizations_policy.qurantine_deny_all_policy is not in configuration)
  - resource "aws_organizations_policy" "qurantine_deny_all_policy" {
      - arn      = "arn:aws:organizations::659087519042:policy/o-625no8z3dd/service_control_policy/p-snkpbuyr" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Condition = {
                          - StringNotLike = {
                              - "aws:username" = [
                                  - "ops1",
                                  - "ops2",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Resource  = "*"
                      - Sid       = "DenyAllActions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-snkpbuyr" -> null
      - name     = "Qurantine account and Deny All Policy" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy.scp_deny_ec2_run will be created
  + resource "aws_organizations_policy" "scp_deny_ec2_run" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:RunInstances"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Deny EC2 Instance Run actions across targeted OUs and accounts"
      + id          = (known after apply)
      + name        = "Deny EC2 Instance Run"
      + tags_all    = (known after apply)
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.AFT-scp_deny_ec2_run will be created
  + resource "aws_organizations_policy_attachment" "AFT-scp_deny_ec2_run" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-qrtdvlzw"
    }

  # aws_organizations_policy_attachment.DumpsterFire-quarantine_deny_all_policy will be created
  + resource "aws_organizations_policy_attachment" "DumpsterFire-quarantine_deny_all_policy" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-1bfads2f"
    }

  # aws_organizations_policy_attachment.DumpsterFire-qurantine_deny_all_policy will be destroyed
  # (because aws_organizations_policy_attachment.DumpsterFire-qurantine_deny_all_policy is not in configuration)
  - resource "aws_organizations_policy_attachment" "DumpsterFire-qurantine_deny_all_policy" {
      - id        = "ou-5gsq-1bfads2f:p-snkpbuyr" -> null
      - policy_id = "p-snkpbuyr" -> null
      - target_id = "ou-5gsq-1bfads2f" -> null
    }

  # aws_organizations_policy_attachment.Production-scp_deny_ec2_connect will be created
  + resource "aws_organizations_policy_attachment" "Production-scp_deny_ec2_connect" {
      + id        = (known after apply)
      + policy_id = "p-fvuu03xe"
      + target_id = "ou-5gsq-vtrsh3ea"
    }

  # aws_organizations_policy_attachment.SRETools-scp_deny_ec2_run will be created
  + resource "aws_organizations_policy_attachment" "SRETools-scp_deny_ec2_run" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-7zshn7gc"
    }

  # aws_organizations_policy_attachment.Sandbox-scp_deny_ec2_run will be created
  + resource "aws_organizations_policy_attachment" "Sandbox-scp_deny_ec2_run" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-9tmkqm3f"
    }

  # aws_organizations_policy_attachment.Security-scp_deny_ec2_run will be created
  + resource "aws_organizations_policy_attachment" "Security-scp_deny_ec2_run" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-vhd3lt42"
    }

  # aws_organizations_policy_attachment.Staging-scp_deny_ec2_connect will be created
  + resource "aws_organizations_policy_attachment" "Staging-scp_deny_ec2_connect" {
      + id        = (known after apply)
      + policy_id = "p-fvuu03xe"
      + target_id = "ou-5gsq-52anzaz7"
    }

  # aws_organizations_policy_attachment.Test-scp_deny_ec2_run will be created
  + resource "aws_organizations_policy_attachment" "Test-scp_deny_ec2_run" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-ectrrn9m"
    }

Plan: 10 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.aws_nuke_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cds_snc_universal_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.quarantine_deny_all_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.scp_deny_ec2_connect"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.scp_deny_ec2_run"]

32 tests, 19 passed, 13 warnings, 0 failures, 0 exceptions

```

</details>
